7.RailsApp_LabReport/app/views/lab_reports/_form.html.erb

    <%= form.label :user_id, style: "display: block" %>
    <%= form.collection_select :user_id, User.all, :id, :full_name %>
---
SELECT "users".* FROM "users"