7.RailsApp_LabReport/app/controllers/lab_reports_controller.rb

  def save_mark
    @lab_report = LabReport.find(params[:id])
    @lab_report.update(
      grade: params[:grade]
    )
---
SELECT "lab_reports".* FROM "lab_reports" WHERE "lab_reports"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "lab_reports" SET "grade" = ?, "updated_at" = ? WHERE "lab_reports"."id" = ?  [["grade", "30"], ["updated_at", "2023-08-23 15:14:06.112780"], ["id", 3]]

  def index
    @lab_reports = LabReport.all
---
SELECT "lab_reports".* FROM "lab_reports"

  def create
    @lab_report = LabReport.new(lab_report_params)

    respond_to do |format|
      if @lab_report.save
---
INSERT INTO "lab_reports" ("title", "description", "grade", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    @lab_report.destroy!
---
DELETE FROM "lab_reports" WHERE "lab_reports"."id" = ?  [["id", 3]]

    def set_lab_report
      @lab_report = LabReport.find(params[:id])
---
SELECT "lab_reports".* FROM "lab_reports" WHERE "lab_reports"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]