7.RailsApp_LabReport/app/controllers/marks_controller.rb

SELECT "lab_reports".* FROM "lab_reports" WHERE "lab_reports"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "lab_reports" SET "grade" = ?, "updated_at" = ? WHERE "lab_reports"."id" = ?  [["grade", "B"], ["updated_at", "2023-08-23 17:42:30.819014"], ["id", 4]]
---
  def create
    @lab_report = LabReport.find(params[:id])
    @lab_report.update(

      grade: params[:grade]
    )